# Reading CSV file

In [1]:
import pandas as pd
df = pd.read_csv('Beast.csv')
print(df.head())

    Name                  Rank  Score_board  Roll_no    Gun    Squad
0  Beast                Heroic            1       20    AWM    Panda
1  Devil           Grandmaster            2       21  M1887      UNB
2  Viper  International Master            3       22    M14  Mortals
3  Ninja               Bronze            31       23     Ar      UNB
4    Don                Silver           21       24  Famas  Mortals

# writing to csv file

In [2]:
import pandas as pd
data = {
    'Name': ["Beast", "DEvil", "Viper"],
    'Rank': ["Heroic", "Grandmaster", "International Master"],
    'Score_board': [1, 2, 3],
    'Roll_no': [20, 21, 22],
    'Gun': ["AWM", "M1887", "M14"],
    'Squad': ["Panda", "UNB", "Mortals"]
}
df = pd.DataFrame(data)
df.to_csv("Beast.csv", index = False)
df

    Name                  Rank  Score_board  Roll_no    Gun    Squad
0  Beast                Heroic            1       20    AWM    Panda
1  DEvil           Grandmaster            2       21  M1887      UNB
2  Viper  International Master            3       22    M14  Mortals

# let's get the data for aprticular row

In [3]:
csv_1 = pd.read_csv("Beast.csv", nrows = 1)
print(csv_1)

    Name    Rank  Score_board  Roll_no  Gun  Squad
0  Beast  Heroic            1       20  AWM  Panda

# What if i need the data of a particular column

In [4]:
column_data = pd.read_csv("Beast.csv", usecols = ["Rank"])
column_data

                   Rank
0                Heroic
1           Grandmaster
2  International Master

# let suppose we need teh data from multiple column

In [5]:
column_data = pd.read_csv("Beast.csv", usecols = [0, 3])
column_data

    Name  Roll_no
0  Beast       20
1  DEvil       21
2  Viper       22

In [6]:
# If i wan tto skip any row
skip_function = pd.read_csv("Beast.csv", skiprows = 0)
print(skip_function)
print()
print()

skip_function = pd.read_csv("Beast.csv", skiprows = 1)
print(skip_function)
print()
print()

skip_function = pd.read_csv("Beast.csv", skiprows = [0,3])
print(skip_function)

    Name                  Rank  Score_board  Roll_no    Gun    Squad
0  Beast                Heroic            1       20    AWM    Panda
1  DEvil           Grandmaster            2       21  M1887      UNB
2  Viper  International Master            3       22    M14  Mortals


   Beast                Heroic  1  20    AWM    Panda
0  DEvil           Grandmaster  2  21  M1887      UNB
1  Viper  International Master  3  22    M14  Mortals


   Beast       Heroic  1  20    AWM Panda
0  DEvil  Grandmaster  2  21  M1887   UNB

# let's make some ther column as our index

In [7]:
new_index = pd.read_csv("Beast.csv", index_col = "Rank")
new_index

                       Name  Score_board  Roll_no    Gun    Squad
Rank
Heroic                Beast            1       20    AWM    Panda
Grandmaster           DEvil            2       21  M1887      UNB
International Master  Viper            3       22    M14  Mortals

# let's make some ther row as our header

In [8]:
row_heder = pd.read_csv("Beast.csv", header = 1)
row_heder

   Beast                Heroic  1  20    AWM    Panda
0  DEvil           Grandmaster  2  21  M1887      UNB
1  Viper  International Master  3  22    M14  Mortals

# If I want to change entiere heading:

In [9]:
# change_heading = pd.read_csv("Beast.csv", names = ["1", "2", "3", "4", "5"])
change_heading = pd.read_csv("Beast.csv", names = [1, 2, 3])
change_heading

                                              1      2        3
Name  Rank                 Score_board  Roll_no    Gun    Squad
Beast Heroic               1                 20    AWM    Panda
DEvil Grandmaster          2                 21  M1887      UNB
Viper International Master 3                 22    M14  Mortals

# If I want to get data using slicing:

In [15]:
df[:1]

    Name    Rank  Score_board  Roll_no  Gun  Squad
0  Beast  Heroic            1       20  AWM  Panda

# let' s check the type of our csv file which we are reading using df -> [df = read_csv("Beast.csv")]

In [20]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

# If I wnt to display all of my index into an array:

In [35]:
print(df.index.array)
print()
print(df.columns.array)

<NumpyExtensionArray>
[0, 1, 2]
Length: 3, dtype: int64

<NumpyExtensionArray>
['Name', 'Rank', 'Score_board', 'Roll_no', 'Gun', 'Squad']
Length: 6, dtype: object

# let's convert this whole in to an numpy array

In [36]:
df.to_numpy()

array([['Beast', 'Heroic', 1, 20, 'AWM', 'Panda'],
       ['DEvil', 'Grandmaster', 2, 21, 'M1887', 'UNB'],
       ['Viper', 'International Master', 3, 22, 'M14', 'Mortals']],
      dtype=object)

# their is another way to do the same means we can convert the whole df into an array using a function

In [42]:
import numpy as np 
v = np.asarray(df)
v

array([['Beast', 'Heroic', 1, 20, 'AWM', 'Panda'],
       ['DEvil', 'Grandmaster', 2, 21, 'M1887', 'UNB'],
       ['Viper', 'International Master', 3, 22, 'M14', 'Mortals']],
      dtype=object)

# if i want to my data into ascending or descending order.

In [50]:
df.sort_index(axis=0, ascending = False)

    Name                  Rank  Score_board  Roll_no    Gun    Squad
2  Viper  International Master            3       22    M14  Mortals
1  DEvil           Grandmaster            2       21  M1887      UNB
0  Beast                Heroic            1       20    AWM    Panda

# I can change the data inside  df like this but it is not the good practice.
* This will give some warnings:

In [55]:
df["Name"][1] = "Devil"
df

C:\Users\ACER\AppData\Local\Temp\ipykernel_220\2851884824.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Name"][1] = "Devil"
C:\Users\ACER\AppData\Local\Temp\ipykernel_220\2851884824.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Name"][1] = "Devil"

    Name                  Rank  Score_board  Roll_no    Gun    Squad
0  Beast                Heroic            1       20    AWM    Panda
1  Devil           Grandmaster            2       21  M1887      UNB
2  Viper  International Master            3       22    M14  Mortals

# This will not give any warning:

In [59]:
df.loc[0, "Name"]  = "Monster"
df

      Name                  Rank  Score_board  Roll_no    Gun    Squad
0  Monster                Heroic            1       20    AWM    Panda
1    Devil           Grandmaster            2       21  M1887      UNB
2    Viper  International Master            3       22    M14  Mortals

# Suppose we need any particular data

In [61]:
df.loc[[0,2], ["Name", "Rank"]]

      Name                  Rank
0  Monster                Heroic
2    Viper  International Master

# iloc() Method: 
* Aagar humko specially ek particular value chaiyee too kya karengee

In [64]:
df.iloc[0,1]

'Heroic'

# lets drop a column and a row:

In [85]:
# df.drop(0, axis = 0) # this will drop the data of axis=0 (means row at zeroth index)
a= df.drop(0, axis = 0) # This is not woring: 
print(a)
print()
b= df.drop(1, axis = 0) # This is not woring: 
print(b)
print()

# Even this is possible 
c= df.drop("Name", axis = 1) # This is not woring: 
print(c)

    Name                  Rank  Score_board  Roll_no    Gun    Squad
1  Devil           Grandmaster            2       21  M1887      UNB
2  Viper  International Master            3       22    M14  Mortals

      Name                  Rank  Score_board  Roll_no  Gun    Squad
0  Monster                Heroic            1       20  AWM    Panda
2    Viper  International Master            3       22  M14  Mortals

                   Rank  Score_board  Roll_no    Gun    Squad
0                Heroic            1       20    AWM    Panda
1           Grandmaster            2       21  M1887      UNB
2  International Master            3       22    M14  Mortals